spec/dummy/app/controllers/doodads_controller.rb

  def index
    @doodads = Doodad.all
---
SELECT "doodads".* FROM "doodads"

  def create
    @doodad = Doodad.new(doodad_params)

    if @doodad.save
---
INSERT INTO "doodads" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "test"], ["description", "test"], ["created_at", "2021-09-03 15:11:02.254411"], ["updated_at", "2021-09-03 15:11:02.254411"]]

  def update
    if @doodad.update(doodad_params)
---
UPDATE "doodads" SET "name" = ?, "updated_at" = ? WHERE "doodads"."id" = ?  [["name", "This is the name"], ["updated_at", "2021-09-02 22:49:46.671783"], ["id", 1]]

  def set_doodad
    @doodad = Doodad.find(params.expect(:id))
---
SELECT "doodads".* FROM "doodads" WHERE "doodads"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]